In [2]:
import pandas as pd

In [3]:
CCTV_Seoul = pd.read_csv('../Data/01. CCTV_in_Seoul.csv', encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [4]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [5]:
CCTV_Seoul.columns[0]

'기관명'

In [6]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]:'구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [7]:
pop_Seoul = pd.read_excel('../Data/01. population_in_Seoul.xls', encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [8]:
#p28 parse_cols은 deprecated -> usecols로 변경 
pop_Seoul = pd.read_excel('../Data/01. population_in_Seoul.xls', header=2, usecols = 'B,D,G,J,N', encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [9]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]:'구별'
                         ,pop_Seoul.columns[1]:'인구수'
                         ,pop_Seoul.columns[2]:'한국인'
                         ,pop_Seoul.columns[3]:'외국인'
                         ,pop_Seoul.columns[4]:'고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [10]:
#1-3 pandas 기초 익히기
import pandas as pd
import numpy as np

In [11]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [12]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-04 -1.232866  0.320252  1.340669 -0.149729
2013-01-05  1.305917 -0.451623 -0.573911  1.003915
2013-01-06  1.564207 -1.400060 -0.050094  1.773765

In [14]:
df.head(3)

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579

In [15]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
df.values

array([[ 0.21858882, -0.55019156, -0.11495633,  2.52812272],
       [ 0.08790162, -0.59830211,  1.30128882,  1.10420338],
       [-0.69593906,  0.1658175 , -1.63955529,  0.29757857],
       [-1.23286591,  0.32025242,  1.34066874, -0.14972924],
       [ 1.30591672, -0.45162267, -0.57391108,  1.00391505],
       [ 1.56420669, -1.4000603 , -0.05009391,  1.77376475]])

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.207968 -0.419018  0.043907  1.092976
std    1.091096  0.616670  1.141264  0.970376
min   -1.232866 -1.400060 -1.639555 -0.149729
25%   -0.499979 -0.586274 -0.459172  0.474163
50%    0.153245 -0.500907 -0.082525  1.054059
75%    1.034085  0.011457  0.963443  1.606374
max    1.564207  0.320252  1.340669  2.528123

In [20]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-04 -1.232866  0.320252  1.340669 -0.149729
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-05  1.305917 -0.451623 -0.573911  1.003915
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-06  1.564207 -1.400060 -0.050094  1.773765

In [21]:
df

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-04 -1.232866  0.320252  1.340669 -0.149729
2013-01-05  1.305917 -0.451623 -0.573911  1.003915
2013-01-06  1.564207 -1.400060 -0.050094  1.773765

In [22]:
df['A']

2013-01-01    0.218589
2013-01-02    0.087902
2013-01-03   -0.695939
2013-01-04   -1.232866
2013-01-05    1.305917
2013-01-06    1.564207
Freq: D, Name: A, dtype: float64

In [23]:
df[0:3]

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579

In [24]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-04 -1.232866  0.320252  1.340669 -0.149729

In [25]:
df[1:3]

                   A         B         C         D
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579

In [26]:
df.loc[dates[0]]

A    0.218589
B   -0.550192
C   -0.114956
D    2.528123
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.218589 -0.550192
2013-01-02  0.087902 -0.598302
2013-01-03 -0.695939  0.165817
2013-01-04 -1.232866  0.320252
2013-01-05  1.305917 -0.451623
2013-01-06  1.564207 -1.400060

In [28]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.087902 -0.598302
2013-01-03 -0.695939  0.165817
2013-01-04 -1.232866  0.320252

In [29]:
df.loc['20130102',['A','B']]

A    0.087902
B   -0.598302
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A']

0.21858882001941443

In [31]:
df.iloc[3]

A   -1.232866
B    0.320252
C    1.340669
D   -0.149729
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.232866  0.320252
2013-01-05  1.305917 -0.451623

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.087902  1.301289
2013-01-03 -0.695939 -1.639555
2013-01-05  1.305917 -0.573911

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01 -0.550192 -0.114956
2013-01-02 -0.598302  1.301289
2013-01-03  0.165817 -1.639555
2013-01-04  0.320252  1.340669
2013-01-05 -0.451623 -0.573911
2013-01-06 -1.400060 -0.050094

In [36]:
df

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-04 -1.232866  0.320252  1.340669 -0.149729
2013-01-05  1.305917 -0.451623 -0.573911  1.003915
2013-01-06  1.564207 -1.400060 -0.050094  1.773765

In [37]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-05  1.305917 -0.451623 -0.573911  1.003915
2013-01-06  1.564207 -1.400060 -0.050094  1.773765

In [38]:
df[df>0]

                   A         B         C         D
2013-01-01  0.218589       NaN       NaN  2.528123
2013-01-02  0.087902       NaN  1.301289  1.104203
2013-01-03       NaN  0.165817       NaN  0.297579
2013-01-04       NaN  0.320252  1.340669       NaN
2013-01-05  1.305917       NaN       NaN  1.003915
2013-01-06  1.564207       NaN       NaN  1.773765

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'one', 'two', 'tree', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.218589 -0.550192 -0.114956  2.528123    one
2013-01-02  0.087902 -0.598302  1.301289  1.104203    one
2013-01-03 -0.695939  0.165817 -1.639555  0.297579    two
2013-01-04 -1.232866  0.320252  1.340669 -0.149729   tree
2013-01-05  1.305917 -0.451623 -0.573911  1.003915   four
2013-01-06  1.564207 -1.400060 -0.050094  1.773765  three

In [41]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [42]:
df[df2['E'].isin(['two','four'])]

                   A         B         C         D
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-05  1.305917 -0.451623 -0.573911  1.003915

In [43]:
df

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.087902 -0.598302  1.301289  1.104203
2013-01-03 -0.695939  0.165817 -1.639555  0.297579
2013-01-04 -1.232866  0.320252  1.340669 -0.149729
2013-01-05  1.305917 -0.451623 -0.573911  1.003915
2013-01-06  1.564207 -1.400060 -0.050094  1.773765

In [44]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.218589 -0.550192 -0.114956  2.528123
2013-01-02  0.306490 -1.148494  1.186332  3.632326
2013-01-03 -0.389449 -0.982676 -0.453223  3.929905
2013-01-04 -1.622315 -0.662424  0.887446  3.780175
2013-01-05 -0.316398 -1.114046  0.313535  4.784090
2013-01-06  1.247809 -2.514107  0.263441  6.557855

In [45]:
df.apply(lambda x: x.max() - x.min())

A    2.797073
B    1.720313
C    2.980224
D    2.677852
dtype: float64

In [46]:
#day02
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [47]:
CCTV_Seoul.sort_values(by='소계', ascending=True).head(5)

     구별   소계  2013년도 이전  2014년  2015년  2016년
9   도봉구  485        238    159     42    386
12  마포구  574        314    118    169    379
17  송파구  618        529     21     68    463
24  중랑구  660        509    121    177    109
23   중구  671        413    190     72    348

In [48]:
CCTV_Seoul.sort_values(by='소계', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년
0   강남구  2780       1292    430    584    932
18  양천구  2034       1843    142     30    467
14  서초구  1930       1406    157    336    398
21  은평구  1873       1138    224    278    468
20  용산구  1624       1368    218    112    398

In [49]:
CCTV_Seoul['최근증가율'] = (CCTV_Seoul['2016년']+CCTV_Seoul['2015년']+CCTV_Seoul['2014년'])/CCTV_Seoul['2013년도 이전']*100
CCTV_Seoul.sort_values(by='최근증가율', ascending=False).head(5)

     구별    소계  2013년도 이전  2014년  2015년  2016년       최근증가율
22  종로구  1002        464    314    211    630  248.922414
9   도봉구   485        238    159     42    386  246.638655
12  마포구   574        314    118    169    379  212.101911
8   노원구  1265        542     57    451    516  188.929889
1   강동구   773        379     99    155    377  166.490765

In [50]:
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [51]:
pop_Seoul.drop([0],inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [52]:
pop_Seoul['구별'].unique()

array(['종로구', '중구', '용산구', '성동구', '광진구', '동대문구', '중랑구', '성북구', '강북구',
       '도봉구', '노원구', '은평구', '서대문구', '마포구', '양천구', '강서구', '구로구', '금천구',
       '영등포구', '동작구', '관악구', '서초구', '강남구', '송파구', '강동구', nan],
      dtype=object)

In [53]:
pop_Seoul[pop_Seoul['구별'].isnull()]

     구별  인구수  한국인  외국인  고령자
26  NaN  NaN  NaN  NaN  NaN

In [54]:
pop_Seoul.drop([26],inplace=True)
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자
1  종로구  162820.0  153589.0   9231.0  25425.0
2   중구  133240.0  124312.0   8928.0  20764.0
3  용산구  244203.0  229456.0  14747.0  36231.0
4  성동구  311244.0  303380.0   7864.0  39997.0
5  광진구  372164.0  357211.0  14953.0  42214.0

In [55]:
pop_Seoul['외국인비율'] = pop_Seoul['외국인'] / pop_Seoul['인구수'] * 100
pop_Seoul['고령자비율'] = pop_Seoul['고령자'] / pop_Seoul['인구수'] * 100
pop_Seoul.head()

    구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
1  종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2   중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3  용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
4  성동구  311244.0  303380.0   7864.0  39997.0  2.526635  12.850689
5  광진구  372164.0  357211.0  14953.0  42214.0  4.017852  11.342849

In [56]:
pop_Seoul.sort_values(by='인구수', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
23  강남구  570500.0  565550.0   4950.0  63167.0  0.867660  11.072217
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [57]:
pop_Seoul.sort_values(by='외국인', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
21   관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291
6   동대문구  369496.0  354079.0  15417.0  54173.0  4.172440  14.661322

In [58]:
pop_Seoul.sort_values(by='외국인비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
19  영등포구  402985.0  368072.0  34913.0  52413.0  8.663598  13.006191
18   금천구  255082.0  236353.0  18729.0  32970.0  7.342345  12.925255
17   구로구  447874.0  416487.0  31387.0  56833.0  7.007998  12.689506
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427

In [59]:
pop_Seoul.sort_values(by='고령자', ascending=False).head(5)

     구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
16  강서구  603772.0  597248.0   6524.0  72548.0  1.080540  12.015794
24  송파구  667483.0  660584.0   6899.0  72506.0  1.033584  10.862599
12  은평구  494388.0  489943.0   4445.0  72334.0  0.899091  14.631019
11  노원구  569384.0  565565.0   3819.0  71941.0  0.670725  12.634883
21  관악구  525515.0  507203.0  18312.0  68082.0  3.484582  12.955291

In [60]:
pop_Seoul.sort_values(by='고령자비율', ascending=False).head(5)

      구별       인구수       한국인      외국인      고령자     외국인비율      고령자비율
9    강북구  330192.0  326686.0   3506.0  54813.0  1.061806  16.600342
1    종로구  162820.0  153589.0   9231.0  25425.0  5.669451  15.615404
2     중구  133240.0  124312.0   8928.0  20764.0  6.700690  15.583909
3    용산구  244203.0  229456.0  14747.0  36231.0  6.038828  14.836427
13  서대문구  327163.0  314982.0  12181.0  48161.0  3.723221  14.720797